{
  "name": "Zeeshan Khalid",
  "status": "Software Developer",
  "description": "I am a dedicated Computer Science graduate with a passion for creating seamless digital experiences. As a Full Stack Developer, I am driven by the desire to turn innovative ideas into practical and elegant solutions..",
  "navigations": [
    {
      "id": 1,
      "name": "Home",
      "url": "/"
    },
    {
      "id": 2,
      "name": "Resume",
      "url": "/resume"
    },
    {
      "id": 3,
      "name": "Projects",
      "url": "/projects"
    },
    {
      "id": 4,
      "name": "Experiences",
      "url": "/experiences"
    },
    {
      "id": 5,
      "name": "About",
      "url": "/about"
    },
    {
      "id": 6,
      "name": "Contact",
      "url": "/contact"
    }
  ],
  "services": [
    {
      "id": 2,
      "name": "Website dev",
      "description": "Developing a website appearance based on design into a website that can be use. With good performance",
      "icon": "/services/service-website.svg"
    },
    {
      "id": 3,
      "name": "WebApps dev",
      "description": "Developing a very well-functioning web applications, various features and performance",
      "icon": "/services/service-webapps.svg"
    },
    {
      "id": 4,
      "name": "Responsive design",
      "description": "Develop a good Frontend design for mobile, tablet, desktop and all screen devices",
      "icon": "/services/service-rwd.svg"
    },
    {
      "id": 5,
      "name": "Best Performance",
      "description": "Develop a good Performance website and web application for more better experience",
      "icon": "/services/service-performance.svg"
    }
  ],
  "skills": [
    {
      "id": 7,
      "name": "React JS",
      "icon": "/skills/skill-reactjs.svg"
    },
    {
      "id": 8,
      "name": "Next JS",
      "icon": "/skills/skill-nextjs.svg"
    },
    {
      "id": 3,
      "name": "Javascript",
      "icon": "/skills/skill-javascript.svg"
    },
    {
      "id": 20,
      "name": "Node JS",
      "icon": "/skills/nodejs.png"
    },
    {
      "id": 6,
      "name": "Laravel",
      "icon": "/skills/laravel-2.svg"
    },
    {
      "id": 5,
      "name": "PHP",
      "icon": "/skills/php.svg"
    },
    {
      "id": 1,
      "name": "HTML 5",
      "icon": "/skills/skill-html5.svg"
    },
    {
      "id": 2,
      "name": "CSS 3",
      "icon": "/skills/skill-css3.svg"
    },
    {
      "id": 4,
      "name": "TailwindCss",
      "icon": "/skills/skill-tailwindcss.svg"
    },
    {
      "id": 11,
      "name": "Github",
      "icon": "/skills/skill-github.svg"
    },
    {
      "id": 16,
      "name": "Visual Studio Code",
      "icon": "/skills/vscode.png"
    },
    {
      "id": 9,
      "name": "Firebase",
      "icon": "/skills/skill-firebase.svg"
    }
  ],
  "project": {
    "title": "Project",
    "desctiption": "Some of the projects that I've worked on to completion with some of the technologies",
    "contents": [
      {
        "id": 1,
        "top": false,
        "width": "300",
        "image": "/projects/AlRayyan.png",
        "name": "Al Rayyan Travels",
        "description": "This is a portfolio website for a travel and tourism company showcases a dynamic range of services and destinations. It features an intuitive design, engaging visuals, and user-friendly navigation to provide visitors with a seamless experience as they explore the company's offerings. The website highlights the company's expertise in curating unforgettable travel experiences, making it easy for potential clients to find and book their next adventure.",
        "stack": "React JS, CSS, Tailwind CSS",
        "category": "Personal Project",
        "url": ""
      },
      {
        "id": 2,
        "top": false,
        "width": "300",
        "image": "/projects/Airlines.png",
        "name": "Arabian Adventure",
        "description": "Arabian Adventure is a complete CRM & Comprehensive repository system for travel agency and supplier payment management system designed to streamline and automate the financial transactions between a company and its suppliers. The system allows users to manage supplier information, track sales data, and monitor payment statuses effectively.",
        "stack": " PHP, MySqli, HTML, CSS, Java Script",
        "category": "Personal Project",
        "url": ""
      },
      {
        "id": 3,
        "top": true,
        "width": "300",
        "image": "/projects/image123.png",
        "name": "Sportzy (E-Commerce)",
        "description": "Sportzy is a robust e-commerce platform built to cater to sports enthusiasts, offering dynamic product listing and real-time inventory management for a seamless shopping experience. The application features advanced functionality, including efficient product categorization, a streamlined add-to-cart process, and secure checkout options. Built with scalable architecture, SPortzy ensures optimal performance and reliability, even during peak traffic. Integrated payment gateways and user authentication systems enhance security, while an intuitive admin panel allows for easy product management, order tracking, and customer support",
        "stack": "Laravel, MySqli, HTML, CSS, Java Script, ",
        "category": "Personal Project",
        "url": ""
      },
      {
        "id": 4,
        "top": false,
        "width": "300",
        "image": "/projects/MS_Traders.png",
        "name": "A Complete POS System",
        "description": "The Stock Management and Invoicing System is a comprehensive business management solution designed for local businesses. This project facilitates the efficient management of inventory, purchasing, sales, and invoicing. It empowers the business owner to keep track of product categories, available products, quantities, and detailed records of both purchases from manufacturers and sales to retailers or end customers.",
        "stack": " PHP, MySqli, HTML, CSS, Java Script",
        "category": "Personal Project",
        "url": ""
      },
      {
        "id": 5,
        "top": false,
        "width": "300",
        "image": "/projects/Ovs2.png",
        "image2": "/projects/Osv2_Inbox.png",
        "name": "Outbound Thrive",
        "description": "The Campaign System project is a real-time, platform-based solution designed to provide users with a seamless and intuitive experience. Built with Next.js, the system features a modern and sleek design, ensuring smooth navigation and interaction. Users can register and authenticate securely using advanced mechanisms, such as OTP (One-Time Password) and email verification, for reliable access. The platform allows for real-time campaign management, offering users the tools they need to create, track, and manage their campaigns with ease, all within a secure and user-friendly environment.",
        "category": "Client Project",
        "stack": " Next JS, MongoDB, Tailwind CSS, Java Script",
        "url": ""
      },
      {
        "id": 6,
        "top": false,
        "width": "300",
        "image": "/projects/Marham.png",
        "name": "Marham Clone",
        "description": "The Marham Clone project is a web-based platform designed to facilitate the process of scheduling doctor's appointments for users. The system allows users to register and browse through various categories of doctors. Users can then select a doctor based on their specialization and book an available appointment slot. On the other side, doctors can register, manage their appointments, and provide necessary recommendations or precautions to the patients.",
        "category": "Personal Project",
        "stack": " PHP, MySqli, HTML, CSS, Java Script",
        "url": ""
      },
      {
        "id": 7,
        "top": false,
        "width": "300",
        "image": "/projects/Expense.png",
        "name": "Expense/Budget Tracker",
        "description": "The Expense/Budget Tracker is a web-based application designed to help users manage their expenses and budgets efficiently. Users can log in, create expense categories, set budgets for each category, and record their expenses. The system provides a detailed dashboard that displays essential information, including the available budget for each category and an overall summary of expenses and budgets.",
        "stack": "React JS, CSS, Google API",
        "category": "Personal Project",
        "url": ""
      },
      {
        "id": 8,
        "top": true,
        "width": "250",
        "image": "/projects/Spis1.png",
        "name": "Smartphone Inspection Services",
        "description": "SPIS is a revolutionary mobile application designed to transform the way users buy and sell pre-owned smartphones. In this fast-paced digital era, where smartphones have become an essential part of our lives, making informed decisions while purchasing or selling a device is crucial. Our app aims to bridge the gap between buyers and sellers by providing a secure and reliable platform with comprehensive inspection services.",
        "stack": "React Native, Node js, mongoDB, React JS, TailwindCSS",
        "category": "Personal Project",
        "url": ""
      },
      {
        "id": 9,
        "width": "250",
        "top": true,
        "image": "/projects/RealEstate.png",
        "name": "Real Estate Mobile App",
        "description": "The Real Estate Mobile App UI Design offers an intuitive and visually appealing experience for users seeking properties. It features dynamic property listings with high-resolution images, advanced filtering options, and interactive maps. The design ensures responsiveness across devices and smooth navigation for easy access to favorites and recent searches. Built with a user-centric approach and scalable architecture, the app supports seamless functionality and growth, enhancing the overall user experience in the real estate market.",
        "stack": "Figma, UI, Web/Mobile Design",
        "category": "Personal Project",
        "url": ""
      }
    ]
  },
  "contact": {
    "title": "Contact",
    "description": "Chat with me through some of the contacts you can call to get acquainted.",
    "contents": [
      {
        "id": 1,
        "icon": "fab fa-whatsapp",
        "name": "WhatsApp",
        "username": "+92 3350826941",
        "category": "Social Media",
        "url": "https://wa.me/+923350826941"
      },
      {
        "id": 2,
        "icon": "fab fa-instagram",
        "name": "Instagram",
        "username": "@zk779_",
        "category": "Social Media",
        "url": "https://www.instagram.com/zk779_/"
      },
      {
        "id": 5,
        "icon": "fab fa-linkedin-in",
        "name": "Linkedin",
        "username": "Zeeshan Khalid",
        "category": "Social Media",
        "url": "https://www.linkedin.com/in/zeeshan-khalid-3b4673306"
      },
      {
        "id": 7,
        "icon": "far fa-envelope",
        "name": "Gmail",
        "username": "zkhalid779@outlook.com",
        "category": "Email",
        "url": "mailto:zkhalid779@outlook.com"
      }
    ]
  },
  "about": {
    "title": "About",
    "description": "Get acquainted further about me, story and biography of my life",
    "contents": [
      {
        "id": 1,
        "name": "My History",
        "description": "I am a Computer Science graduate with a strong foundation in both the MERN stack and PHP, specializing in full stack development. My academic journey has equipped me with analytical problem-solving skills and a deep understanding of software development best practices."
      },
      {
        "id": 2,
        "name": "What am i Doing",
        "description": "Currently, I am focused on building seamless digital experiences by leveraging my expertise in the MERN stack and PHP. I am passionate about transforming innovative ideas into efficient and elegant applications, and I thrive in collaborative, dynamic work environments."
      },
      {
        "id": 3,
        "name": "What Next",
        "description": "I am eager to take on new challenges that allow me to further develop my skills and contribute to impactful projects. I aim to join a forward-thinking team where I can apply my technical expertise to create reliable and user-friendly solutions."
      },
      {
        "id": 4,
        "name": "Dreams and Wishes",
        "description": "My dream is to continuously evolve as a full stack developer and play a significant role in shaping the future of technology. I aspire to work on innovative projects that make a positive impact and to collaborate with like-minded professionals who share my passion for creating cutting-edge solutions."
      }
    ]
  },
  "resume": {
    "title": "Resume",
    "description": "Explore my experiences, Rewards, and education, as well as my activeness",
    "contents": [
      {
        "id": 3,
        "title": "Educational Background",
        "contents": [
          {
            "id": 1,
            "timestamp": "2019 - 2023",
            "name": "Bachelor of Computer Science",
            "info": "NFC University, Affiliated with UET Lahore",
            "description": "I earned my Bachelor's in Computer Science, focusing on Data Structures, Algorithms, Machine Learning, Cloud Computing, and Object-Oriented Programming. During my studies, I honed my skills in Python, C++, and JavaScript, equipping myself for software development roles and practical applications."
          },
          {
            "id": 2,
            "timestamp": "2017 - 2019",
            "name": "FSc Pre-Engineering",
            "info": "Punjab College",
            "description": "I completed my pre-university education at Punjab College, where I gained a solid foundation in core scientific and engineering principles, preparing me for higher education in Computer Science."
          },
          {
            "id": 3,
            "timestamp": "- 2017",
            "name": "Matriculation",
            "info": "Sandal College",
            "description": "I graduated from Sandal College, where I completed my matriculation and developed a strong academic base in science and mathematics."
          }
        ]
      },
      {
        "id": 2,
        "title": "Achievements I Completed",
        "contents": [
          {
            "id": 4,
            "timestamp": "SEP 2023",
            "name": "Task Management System",
            "info": "Hackathon",
            "description": "Developed a comprehensive Task Management system using PHP and MySQLi, enabling efficient task tracking and management.",
            "url": "https://drive.google.com/file/d/1ZsbvkSEEvXtZcVLd0DdCxgb8t527HT7e/view?usp=sharing",
            "list": [
              {
                "id": 1,
                "name": "Implemented CRUD operations to allow users to create, read, update, and delete tasks, ensuring full control over task management.",
                "level": "Intermediate"
              },
              {
                "id": 2,
                "name": "Integrated a user authentication system to secure access to task data and ensure that only authorized users can manage tasks.",
                "level": "Intermediate"
              },
              {
                "id": 3,
                "name": "Utilized MySQLi for efficient database handling, enabling reliable storage and retrieval of task information.",
                "level": "Intermediate"
              },
              {
                "id": 4,
                "name": "Designed a responsive user interface to provide an intuitive and user-friendly experience, improving task management efficiency.",
                "level": "Intermediate"
              }
            ]
          }
        ]
      }
    ]
  }
}